

export const texts = {
  serverProblem: `مشکل داخلی به وجود آمده، لطفا دوباره تلاش کنید.`,
  welcome: `به ربات آنتن خوش آمدید.🌻
  این ربات پیام‌های گروه‌های شما را بر اساس هشتگ به کانال‌ها فوروارد می‌کند. برای استفاده روی دکمه‌ی «اضافه کردن گروه جدید» را لمس کنید.`,
  unknown: "پیام ناشناخته است.🤔",
  chooseGroupName: `گروه را انتخاب کنید.
  🔹 برای اینکه بتوانید گروهی را انتخاب کنید، لازم است هم شما و هم ربات عضو گروه باشید. بعد از انجام این کار‌ها دکمه‌ی «بارگذاری دوباره» را لمس کنید.
  🔹 اگر شرایط بالا موجود است، ولی همچنان نام گروه در لیست وجود ندارد، یک بار ربات را از گروه خارج و سپس دوباره وارد کنید. پس از آن دکمه‌ی «بارگذاری دوباره» را لمس کنید.`,
  chooseChannelName: `کانال را انتخاب کنید.
  🔹 برای اینکه کانال در لیست زیر قرار گیرد، باید هم شما و هم ربات ادمین آن کانال باشید. بعد از انجام این کار‌ها دکمه‌ی «بارگذاری دوباره» را لمس کنید.
  🔹 اگر شرایط بالا موجود است، ولی همچنان نام کانال در لیست وجود ندارد، یک بار ربات را از گروه خارج و سپس دوباره وارد کنید. پس از آن دکمه‌ی «بارگذاری دوباره» را لمس کنید.`,
  chooseHashtags: `هشتگ‌ها را بنویسید. به عنوان مثال:
  #مقاله #فیزیک #فیثاغورس #math`,
  atLeastAHashtag: "در پیام فرستاده شده هشتگی وجود نداشت. حداقل یک هشتگ باید فرستاده شود.",
  successfulOperation: "کار با موفقیت انجام شد.✌",
  mustBeInGroup: "برای اضافه کردن گروه شما باید در آن حضور داشته باشید.🧐",
  OK: "به روی چشم",

  keyAddNewGroup: "اضافه کردن گروه جدید",
  keyReload: "بارگذاری دوباره",
  keyBack: "بازگشت",
  keyExit: "خروج"
}


export const keyboards = {
  default: [[texts.keyAddNewGroup]],
  staticKeys: [texts.keyReload, texts.keyBack, texts.keyExit],
  hashtag: [[texts.keyBack, texts.keyExit]]
}